Autodesk.Revit.DB.Macros.MacroManager.GetMacroManager(Autodesk.Revit.DB.Document)
Gets the Macro manager from the document.
document:
The document.
Returns:
The new Macro manager object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.Macros.MacroManager.GetMacroManager(Autodesk.Revit.ApplicationServices.Application)
Gets the Macro manager from the application.
application:
The application.
Returns:
The new Macro manager object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.Macros.MacroManager.GetApplicationMacroSecurityOptions(Autodesk.Revit.ApplicationServices.Application)
Gets the application macro security options.
application:
The application.
Returns:
Returns the application macro security options.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.Macros.MacroManager.SetApplicationMacroSecurityOptions(Autodesk.Revit.ApplicationServices.Application,Autodesk.Revit.DB.Macros.ApplicationMacroOptions)
Sets the application macro security options.
application:
The application.
macroOptions:
The application macro security options.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.Macros.MacroManager.GetDocumentMacroSecurityOptions(Autodesk.Revit.ApplicationServices.Application)
Gets the document macro security options.
application:
The application.
Returns:
Returns the document macro security options.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.Macros.MacroManager.SetDocumentMacroSecurityOptions(Autodesk.Revit.ApplicationServices.Application,Autodesk.Revit.DB.Macros.DocumentMacroOptions)
Sets the document macro security options.
application:
The application.
macroOptions:
The document macro security options.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.Macros.MacroManager.Contains(Autodesk.Revit.DB.Macros.MacroModule)
Indicates the given module is a member of this collection.
module:
The module.
Returns:
Returns true if the given module is a member of this collection, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.Macros.MacroManager.RemoveModule(Autodesk.Revit.DB.Macros.MacroModule)
Removes a MacroModule from the application or document.
Remarks:
Note: document-level modules will not be removed to the document until the document is saved.
Thus this operation is not undoable and does not require an open transaction even for document-level modules.
module:
The module will be removed.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given module is not a member of this collection.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the given module is a UI module.
Since:
2014

Autodesk.Revit.DB.Macros.MacroManager.AddModule(Autodesk.Revit.DB.Macros.ModuleSettings)
Adds a MacroModule to the application or document.
Remarks:
Note: document-level modules will not be saved to the document until the document is saved.
Thus this operation is not undoable and does not require an open transaction even for document-level modules.
moduleSettings:
The module settings.
Returns:
The new module.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the module name is duplicated with the existing one,
or the name is too long, or the name contains invalid identifier(s),
such as include "#", "%", ... and key words in C# or VB.NET.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014